podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TRGMUX1_MKE16F16.svd.xml
<!--
Devices using this peripheral: 
      MKE14F16
      MKE14Z7
      MKE15Z7
      MKE16F16
      MKE18F16
-->
      <peripheral>
         <?sourceFile "TRGMUX1_MKE16F16" ?>
         <name>TRGMUX1</name>
         <description>Trigger MUX Control</description>
         <groupName>TRGMUX</groupName>
         <headerStructName>TRGMUX1</headerStructName>
         <baseAddress>0x40063000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>TRGMUXn%s</name>
               <?hide?>
               <description>TRGMUX DMAMUX Register</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SEL1</name>
                     <description>Trigger MUX Input 1 Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SEL2</name>
                     <description>Trigger MUX Input 2 Source Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SEL3</name>
                     <description>Trigger MUX Input 3 Source Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="TRGMUXn%s"><dim>0</dim><dimIncrement>0</dimIncrement><dimIndex></dimIndex> <name>TRGMUX_CTRL0</name> <description>TRGMUX CTRL0 Register</description> <addressOffset>0x0</addressOffset> </register>
            <register derivedFrom="TRGMUXn%s"><dim>0</dim><dimIncrement>0</dimIncrement><dimIndex></dimIndex> <name>TRGMUX_CTRL1</name> <description>TRGMUX CTRL1 Register</description> <addressOffset>0x4</addressOffset> </register>
         </registers>
      </peripheral>
